kc4712/NRF52840/drivers/spi_flash.c
/**
  ******************************************************************************
  * @file    SPI/SPI_FLASH/spi_flash.c
  * @author  MCD Application Team
  * @version V1.1.0
  * @date    13-April-2012
  * @brief   This file provides a set of functions needed to manage the SPI M25Pxxx
  *          FLASH memory.
  *
  *          ===================================================================
  *          Notes:
  *           - There is no SPI FLASH memory available in STM322xG-EVAL board,
  *             to use this driver you have to build your own hardware.
  *          ===================================================================
  *
  *          It implements a high level communication layer for read and write
  *          from/to this memory. The needed STM32 hardware resources (SPI and
  *          GPIO) are defined in spi_flash.h file, and the initialization is
  *          performed in sFLASH_LowLevel_Init() function.
  *
  *          You can easily tailor this driver to any development board, by just
  *          adapting the defines for hardware resources and sFLASH_LowLevel_Init()
  *          function.
  *
  *          +-----------------------------------------------------------+
  *          |                     Pin assignment                        |
  *          +-----------------------------+---------------+-------------+
  *          |  STM32 SPI Pins             |     sFLASH    |    Pin      |
  *          +-----------------------------+---------------+-------------+
  *          | sFLASH_CS_PIN               | ChipSelect(/S)|    1        |
  *          | sFLASH_SPI_MISO_PIN / MISO  |   DataOut(Q)  |    2        |
  *          |                             |   VCC         |    3 (3.3 V)|
  *          |                             |   GND         |    4 (0 V)  |
  *          | sFLASH_SPI_MOSI_PIN / MOSI  |   DataIn(D)   |    5        |
  *          | sFLASH_SPI_SCK_PIN / SCK    |   Clock(C)    |    6        |
  *          |                             |    VCC        |    7 (3.3 V)|
  *          |                             |    VCC        |    8 (3.3 V)|
  *          +-----------------------------+---------------+-------------+
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT 2012 STMicroelectronics</center></h2>
  *
  * Licensed under MCD-ST Liberty SW License Agreement V2, (the "License");
  * You may not use this file except in compliance with the License.
  * You may obtain a copy of the License at:
  *
  *        http://www.st.com/software_license_agreement_liberty_v2
  *
  * Unless required by applicable law or agreed to in writing, software
  * distributed under the License is distributed on an "AS IS" BASIS,
  * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  * See the License for the specific language governing permissions and
  * limitations under the License.
  *
  ******************************************************************************
  */

/* 					Description : W25Q128FVSG  : 16Mbyte.  														*/
/*					Block : 0 to 255, 256 Max Block Number.														*/
/*					1 Block Size: 64Kbytes.
						1 Block : 0 to 15 Sectors , 16 Max Sectors.
						1 Sectors Size : size 4Kbytes

*/

/* Includes ------------------------------------------------------------------*/
#include <stdio.h>
#include <string.h>
#include "spi_flash.h"
#include "spi_master_previous.h"
#include  "spi.h"
#ifdef GC_NRF52_SPI_FLASH
	#include "nrf52.h" /* hkim 2016.7.7 */
	#include "nrf_error.h"
	#include "nrf_spim.h" //GC_NRF52_PAHR
	#include "nrf_drv_spi.h"
	#include "nrf_drv_config.h"
	#include "app_util_platform.h"
	#include "nrf_drv_ppi.h"
	#include "nrf_ppi.h"
	#include "nrf_drv_gpiote.h"
	#include "flash_control.h"
#endif /* GC_NRF52_SPI_FLASH */

#ifdef GC_NRF52_SPI_FLASH 

//extern const nrf_drv_spi_t spi;
#ifdef GC_COACH_FIT_PCB
  #define GC_SPI_FLASH_CS_PIN   16 /**< SPI CS Pin.*/
#elif defined GC_COACH_FIT_DK52
  #define GC_SPI_FLASH_CS_PIN   27 /**< SPI CS Pin.*/
#else
#endif

/* GC_NRF52_PAHR */
volatile uint8_t gc_flash_status;
static uint32_t gc_flash_sectoraddr;
static uint8_t gc_flash_tx[255];


void gc_spi_flash_sector_erase(void);
void gc_spi_flash_write(void);
/* end of GC_NRF52_PAHR */

static const nrf_drv_spi_t spi_flash = NRF_DRV_SPI_INSTANCE(GC_SPI_FLASH_INSTANCE);  /**< SPI instance. */

static volatile bool spi_xfer_done;  /**< Flag used to indicate that SPI instance completed the transfer. */
nrf_ppi_channel_t ppi_channel_workaround;

/**
 * @brief Work-around for transmitting 1 byte with SPIM.
 *
 * @param spim: The SPIM instance that is in use.
 * @param ppi_channel: An unused PPI channel that will be used by the
        workaround.
 * @param gpiote_channel: An unused GPIOTE channel that will be used by
        the workaround.
 *
 * @warning Must not be used when transmitting multiple bytes.
 * @warning After this workaround is used, the user must reset the PPI
        channel and the GPIOTE channel before attempting to transmit multiple
        bytes.
 */
#if 0
void setup_workaround_for_ftpan_58(NRF_SPIM_Type *spim, 
                                   uint32_t ppi_channel, 
                                   uint32_t gpiote_channel){

  // Create an event when SCK toggles.
  NRF_GPIOTE->CONFIG[gpiote_channel] = 
      (GPIOTE_CONFIG_MODE_Event << GPIOTE_CONFIG_MODE_Pos) | 
      (spim->PSEL.SCK << GPIOTE_CONFIG_PSEL_Pos) | 
      (GPIOTE_CONFIG_POLARITY_Toggle <<GPIOTE_CONFIG_POLARITY_Pos);

  // Stop the spim instance when SCK toggles.
  NRF_PPI->CH[ppi_channel].EEP = (uint32_t)&NRF_GPIOTE->EVENTS_IN[gpiote_channel];
  NRF_PPI->CH[ppi_channel].TEP = (uint32_t)&spim->TASKS_STOP;
  NRF_PPI->CHENSET = 1U << ppi_channel;
}
#endif		

#ifdef GC_NRF52_SPI_FLASH_INT
void spi_master_event_handler(nrf_drv_spi_evt_t const * p_event)
{
	printf("\r\n flash isr : SPI evt %d", p_event->type);
  switch (p_event->type)
  {
		//if event is equal to NRF_DRV_SPI_EVENT_DONE, then this block is executed to check if data is valid
 
