kc4712/NRF52840/drivers/spi_flash.c
    case NRF_DRV_SPI_EVENT_DONE:   

			//disable the ppi channel
			nrf_drv_ppi_channel_disable(ppi_channel_workaround);

			//disable a GPIOTE output pin task.
			nrf_drv_gpiote_out_task_disable(SPI1_CONFIG_SCK_PIN);
			nrf_drv_gpiote_in_uninit(SPI1_CONFIG_SCK_PIN); //added by hkim 2016.6.21 
		
			if (gc_flash_status == GC_FLASH_READ)
			{
				printf("\r\n flash isr : read done");
				gc_flash_status = 0;
			}
			else if (gc_flash_status == GC_FLASH_WRITE_ENABLE_TO_ERASE)
			{
				printf("\r\n flash isr : write enable to erase done");
				gc_flash_status = 0;
				gc_spi_flash_sector_erase();
			}
			else if (gc_flash_status == GC_FLASH_WRITE_ENABLE_TO_WRITE)
			{
				printf("\r\n flash isr : write enable to write done");
				gc_flash_status = 0;
				gc_spi_flash_write();
			}
			else {}

			// Check if data are valid.
			//err_code = bsp_indication_set(BSP_INDICATE_RCV_OK);
			//APP_ERROR_CHECK(err_code);

			// Inform application that transfer is completed.
			spi_xfer_done = true;
			break;

    //if event is not equal to NRF_DRV_SPI_EVENT_DONE, then nothing happens
    default:
			// No implementation needed.
      break;
  }
}
#endif /* GC_NRF52_SPI_FLASH_INT */

void in_pin_handler(nrf_drv_gpiote_pin_t pin, nrf_gpiote_polarity_t action)
{
	/* GPIOTE output pin을 toggle 한다 */
	nrf_drv_gpiote_out_toggle(SPI1_CONFIG_SCK_PIN);
}
#if 1

int spi_send_recv(uint8_t * const p_tx_data,
                          uint8_t * const p_rx_data,
                          const uint16_t  len)
{
	uint32_t err_code=0;
	NRF_SPIM_Type * p_spim = spi_flash.p_registers;
	
	if (len == 1){
		ret_code_t err_code;
 
    // initializes the GPIOTE channel so that SCK toggles generates events
		//GPIOTE의 Task 와 이벤트를 할당. 
    nrf_drv_gpiote_in_config_t config = GPIOTE_CONFIG_IN_SENSE_TOGGLE(true);
		/* GPIOTE input pin 초기화. 두번재 파라미터의 config가 발생하면 in_pin_hander가 호출됨 */
    err_code = nrf_drv_gpiote_in_init(SPI1_CONFIG_SCK_PIN, &config, in_pin_handler);
		if (err_code != NRF_SUCCESS)
			printf("\r\nGPIOTE in-init error(code %d)", err_code);
    
		//allocates the first unused PPI Channel
		err_code = nrf_drv_ppi_channel_alloc(&ppi_channel_workaround);
		if (err_code != NRF_SUCCESS)
			printf("\r\nPPI-ch alloc error(code %d)", err_code);
				
		err_code = nrf_drv_ppi_channel_assign(ppi_channel_workaround, 
																					nrf_drv_gpiote_in_event_addr_get(SPI1_CONFIG_SCK_PIN), 
																					(uint32_t)&p_spim->TASKS_STOP);
		if (err_code != NRF_SUCCESS)
			printf("\r\nPPI-ch assign error(code %d)", err_code);
    
		//enable the PPI channel.
		err_code = nrf_drv_ppi_channel_enable(ppi_channel_workaround);
		if (err_code != NRF_SUCCESS)
			printf("\r\nPPI-ch enable error(code %d)", err_code);

		//enable the GPIOTE output pin task.
		nrf_drv_gpiote_in_event_enable(SPI1_CONFIG_SCK_PIN, false);

		//Start transfer of data
		spi_xfer_done = false;
		err_code = nrf_drv_spi_transfer(&spi_flash, p_tx_data, len, p_rx_data, len);
		//printf("\r\n SPI result(1 Byte) : %d", err_code);
		if (err_code != NRF_SUCCESS)
			printf("\r\nSPI transfer error(code %d)", err_code);
		
#ifndef GC_NRF52_SPI_FLASH_INT
		err_code = nrf_drv_ppi_channel_disable(ppi_channel_workaround);
		if (err_code != NRF_SUCCESS)
			printf("\r\nPPI-ch disable error(code %d)", err_code);
				
		err_code = nrf_drv_ppi_channel_free(ppi_channel_workaround);
		if (err_code != NRF_SUCCESS)
			printf("\r\nPPI-ch free error(code %d)", err_code);
				
		nrf_drv_gpiote_out_task_disable(SPI1_CONFIG_SCK_PIN);
		nrf_drv_gpiote_in_uninit(SPI1_CONFIG_SCK_PIN); //added by hkim 2016.6.21 
#endif 
    //uninitializes the gpiote channel
		//the gpiote channel is represented by a 32-bit variable
    //not sure if we need to unintitialize the pin, or if we can just disable it
    //nrf_drv_gpiote_out_uninit(SPIM0_SCK_PIN); 
		
		return err_code;
	}
  else
	{
		// Start transfer.
		spi_xfer_done = false;
		err_code = nrf_drv_spi_transfer(&spi_flash, p_tx_data, len, p_rx_data, (uint8_t)len);
		//printf("\r\n SPI result : %d", err_code);
		if (err_code != NRF_SUCCESS)
			printf("\r\nSPI transfer error(code %d)", err_code);
		
		return err_code;
  }
 
	//nrf_delay_ms(delay);
}
#else

#endif 

void gc_spi_flash_init(void)
{
	int32_t err_code=0;
	
	nrf_drv_spi_config_t spi_flash_config = NRF_DRV_SPI_DEFAULT_CONFIG(GC_SPI_FLASH_INSTANCE);
	#if 1 /* GC_NRF52_PAHR */
  spi_flash_config.ss_pin = GC_SPI_FLASH_CS_PIN;
	spi_flash_config.frequency    = NRF_DRV_SPI_FREQ_4M;
	spi_flash_config.orc    = 0x00;
	#endif 
	#if 0 
	printf("\r\n** SPI Flash config result");
	printf("\r\n sck_pin %d, mosi_pin %d, miso_pin %d, ss_pin %d, irq_priority %d, orc %d, freq 0x%8x, mode %d, bit-order %d",
			spi_flash_config.sck_pin, spi_flash_config.mosi_pin, spi_flash_config.miso_pin, spi_flash_config.ss_pin, spi_flash_config.irq_priority,
			spi_flash_config.orc, spi_flash_config.frequency, spi_flash_config.mode, spi_flash_config.bit_order );
	#endif 
#ifdef GC_NRF52_SPI_FLASH_INT
	err_code = nrf_drv_spi_init(&spi_flash, &spi_flash_config, spi_master_event_handler); 
#else
	err_code = nrf_drv_spi_init(&spi_flash, &spi_flash_config, NULL);
#endif 
#ifndef _FIT_ETRI_TEST_ 
  if (err_code == NRF_SUCCESS)
		printf("\r\n Flash SPI initialization. done");
	else
		printf("\r\n Flash SPI initialization. fail");
#endif
	
	/* 
			NRF52 can't transmit one byte through SPIM. 
			Workaround function is setup_workaround_for_ftpan_58()
			Following link privide you for more information.
			http://infocenter.nordicsemi.com/pdf/nRF52832_Errata_v1.1.pdf
	*/
}
#elif defined GC_NRF51_SPI_FLASH
static unsigned int *m_spi1_base_address=0;

void Init_SPI_1(void)
{
	m_spi1_base_address = spi_master_init((SPIModuleNumber)SPI1, SPI_MODE0,  false );
	if (m_spi1_base_address == 0)
	{
		printf("\n\r spi1 init fail.");
	}
}

void Init_SPI_Flash_PORT(void)
{

	Init_SPI_1();

}
#else /* GC_NRF52_SPI_FLASH */
#endif /* GC_NRF52_SPI_FLASH */

/** @addtogroup STM32F2xx_StdPeriph_Examples
  * @{
  */

/** @addtogroup SPI_FLASH
  * @{
  */
extern void tmp_delay(int delay);

extern int sys_spi_get(unsigned char *pc);

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/


void sFLASH_TxByte(unsigned char byte);

/* Private functions ---------------------------------------------------------*/

