kc4712/NRF52840/drivers/spi_flash.c
void sFLASH_delay(int delay)
{
/*
  sFLASH_TxByte(0x00);

	tmp_delay(delay);
*/
	return;
}
/**
  * @brief  DeInitializes the peripherals used by the SPI FLASH driver.
  * @param  None
  * @retval None
  */




/*-------------------------------------------------------------------------*/
/* bsp_spi_flash.c reference.. */

/**************************************************************************
* Function Name  : SPI_FLASH_SectorErase
* Description    : Erases the specified FLASH sector.
* Input          : SectorAddr: address of the sector to erase.
* Output         : None
* Return         : None
*******************************************************************************/
void gc_spi_flash_sector_erase(void)  //GC_NRF52_PAHR
{
	unsigned char tx_data[4];
	unsigned char rx_data[4];

	// 4k erase
	tx_data[0]=W25X_SectorErase;
	tx_data[1]=(gc_flash_sectoraddr & 0xFF0000) >> 16;
	tx_data[2]=(gc_flash_sectoraddr& 0xFF00) >> 8;
	tx_data[3]=gc_flash_sectoraddr & 0xFF;

	spi_send_recv( tx_data,rx_data,4);
}
void SPI_FLASH_SectorErase(unsigned int SectorAddr)
{
	uint8_t tx_data[4];
	uint8_t rx_data[4];
	
#ifdef GC_NRF52_SPI_FLASH_INT
	gc_flash_status = GC_FLASH_WRITE_ENABLE_TO_ERASE;
	gc_flash_sectoraddr = SectorAddr;
#endif 	

	SPI_FLASH_WriteEnable();

#ifndef GC_NRF52_SPI_FLASH_INT
	// 4k erase
	tx_data[0]=W25X_SectorErase;
	tx_data[1]=(SectorAddr & 0xFF0000) >> 16;
	tx_data[2]=(SectorAddr& 0xFF00) >> 8;
	tx_data[3]=SectorAddr & 0xFF;

#ifdef GC_NRF52_SPI_FLASH
	//if (nrf_drv_spi_transfer(&spi_flash, tx_data, sizeof(tx_data), rx_data, sizeof(rx_data)) != NRF_SUCCESS)
	spi_send_recv( tx_data,rx_data,4);
#elif defined GC_NRF51_SPI_FLASH
	if(!spi_master_tx_rx(m_spi1_base_address, 4, tx_data, rx_data))
	{
		printf("\n\r[SPI_FLASH_PageWrite] spi rx/tx fail.");
	}
#else /* GC_NRF52_SPI_FLASH */
#endif  /* GC_NRF52_SPI_FLASH */	
#endif /* GC_NRF52_SPI_FLASH_INT */
}

#if 1
/**************************************************************************
* Function Name  : SPI_FLASH_BLOCK32K_Erase
* Description    : Erases the specified Block 64Ksector.
* Input          : SectorAddr: address of the sector to erase.
* Output         : None
* Return         : None
***************************************************************************/

void SPI_FLASH_Block64K_Erase(unsigned int BlockAddr)
{
#if 0
  /* Send write enable instruction */
  SPI_FLASH_WriteEnable();
  SPI_FLASH_WaitForWriteEnd();
  /* Sector Erase */
  /* Select the FLASH: Chip Select low */
  SPI_FLASH_CS_LOW();
  /* Send Sector Erase instruction */
  SPI_FLASH_SendByte(W25X_BlockErase);
  /* Send SectorAddr high nibble address byte */
  SPI_FLASH_SendByte((BlockAddr & 0xFF0000) >> 16);
  /* Send SectorAddr medium nibble address byte */
  SPI_FLASH_SendByte((BlockAddr & 0xFF00) >> 8);
  /* Send SectorAddr low nibble address byte */
  SPI_FLASH_SendByte(BlockAddr & 0xFF);
  /* Deselect the FLASH: Chip Select high */
  SPI_FLASH_CS_HIGH();
  /* Wait the end of Flash writing */
  SPI_FLASH_WaitForWriteEnd();
#endif
}

#endif

/*******************************************************************************
* Function Name  : SPI_FLASH_BulkErase
* Description    : Erases the entire FLASH.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void SPI_FLASH_BulkErase(void)
{
#if 0
  /* Send write enable instruction */
  SPI_FLASH_WriteEnable();

  /* Bulk Erase */
  /* Select the FLASH: Chip Select low */
  SPI_FLASH_CS_LOW();
  /* Send Bulk Erase instruction  */
  SPI_FLASH_SendByte(W25X_ChipErase);
  /* Deselect the FLASH: Chip Select high */
  SPI_FLASH_CS_HIGH();

  /* Wait the end of Flash writing */
  SPI_FLASH_WaitForWriteEnd();
  #endif
}

/*******************************************************************************
* Function Name  : SPI_FLASH_PageWrite
* Description    : Writes more than one byte to the FLASH with a single WRITE
*                  cycle(Page WRITE sequence). The number of byte can't exceed
*                  the FLASH page size.
* Input          : - pBuffer : pointer to the buffer  containing the data to be
*                    written to the FLASH.
*                  - WriteAddr : FLASH's internal address to write to.
*                  - NumByteToWrite : number of bytes to write to the FLASH,
*                    must be equal or less than "SPI_FLASH_PageSize" value.
* Output         : None
* Return         : None
*******************************************************************************/
void gc_spi_flash_write(void)  //GC_NRF52_PAHR
{
	//unsigned char tx_data[255];
	unsigned char rx_data[255];
	
	gc_flash_tx[0]=W25X_PageProgram;
	gc_flash_tx[1]=(gc_flash_sectoraddr & 0xFF0000) >> 16;
	gc_flash_tx[2]=(gc_flash_sectoraddr& 0xFF00) >> 8;
	gc_flash_tx[3]=gc_flash_sectoraddr & 0xFF;

	spi_send_recv(gc_flash_tx, rx_data, 255); 
}



int32_t SPI_FLASH_PageWrite(unsigned char* pBuffer, unsigned int WriteAddr)
{
#ifdef GC_NRF52_SPI_FLASH
	int32_t err_code;
	unsigned char rx_data[255];
#elif defined GC_NRF51_SPI_FLASH
	unsigned char rx_data[260];
#else 
#endif 

	/* Enable the write access to the FLASH */
#ifdef GC_NRF52_SPI_FLASH_INT
	gc_flash_status = GC_FLASH_WRITE_ENABLE_TO_WRITE; //GC_NRF52_PAHR 
	gc_flash_sectoraddr = WriteAddr; //GC_NRF52_PAHR 
	memcpy(gc_flash_tx, pBuffer,255);
#endif 
	
	err_code = SPI_FLASH_WriteEnable();
	if (err_code != NRF_SUCCESS)
		return err_code;
	
#ifndef GC_NRF52_SPI_FLASH_INT
	pBuffer[0]=W25X_PageProgram;
	pBuffer[1]=(WriteAddr & 0xFF0000) >> 16;
	pBuffer[2]=(WriteAddr& 0xFF00) >> 8;
	pBuffer[3]=WriteAddr & 0xFF;

#ifdef GC_NRF52_SPI_FLASH
	//if (nrf_drv_spi_transfer(&spi_flash, pBuffer, 255, rx_data, sizeof(rx_data)) != NRF_SUCCESS)
	return spi_send_recv(pBuffer, rx_data, 255); 
#elif defined GC_NRF51_SPI_FLASH
	if(!spi_master_tx_rx(m_spi1_base_address, 260, pBuffer, rx_data))
	{
		printf("\n\r[SPI_FLASH_PageWrite] spi rx/tx fail.");
	}
#else /* GC_NRF52_SPI_FLASH */
#endif  /* GC_NRF52_SPI_FLASH */
	//ks_printf("\n\r[spi_flash]  rx = %06x", data);

	//DumpMemory(pBuffer,260);
#endif /* GC_NRF52_SPI_FLASH_INT */
}

