kc4712/NRF52840/drivers/spi_flash.c
/*******************************************************************************
* Function Name  : SPI_FLASH_BufferWrite
* Description    : Writes block of data to the FLASH. In this function, the
*                  number of WRITE cycles are reduced, using Page WRITE sequence.
* Input          : - pBuffer : pointer to the buffer  containing the data to be
*                    written to the FLASH.
*                  - WriteAddr : FLASH's internal address to write to.
*                  - NumByteToWrite : number of bytes to write to the FLASH.
* Output         : None
* Return         : None
*******************************************************************************/
void SPI_FLASH_BufferWrite(unsigned char* pBuffer, unsigned int WriteAddr, unsigned short NumByteToWrite)
{
#if 0
  unsigned char NumOfPage = 0, NumOfSingle = 0, Addr = 0, count = 0, temp = 0;

  Addr = WriteAddr % SPI_FLASH_PageSize;
  count = SPI_FLASH_PageSize - Addr;
  NumOfPage =  NumByteToWrite / SPI_FLASH_PageSize;
  NumOfSingle = NumByteToWrite % SPI_FLASH_PageSize;

  if (Addr == 0) /* WriteAddr is SPI_FLASH_PageSize aligned  */
  {
    if (NumOfPage == 0) /* NumByteToWrite < SPI_FLASH_PageSize */
    {
      SPI_FLASH_PageWrite(pBuffer, WriteAddr, NumByteToWrite);
    }
    else /* NumByteToWrite > SPI_FLASH_PageSize */
    {
      while (NumOfPage--)
      {
        SPI_FLASH_PageWrite(pBuffer, WriteAddr, SPI_FLASH_PageSize);
        WriteAddr +=  SPI_FLASH_PageSize;
        pBuffer += SPI_FLASH_PageSize;
      }

      SPI_FLASH_PageWrite(pBuffer, WriteAddr, NumOfSingle);
    }
  }
  else /* WriteAddr is not SPI_FLASH_PageSize aligned  */
  {
    if (NumOfPage == 0) /* NumByteToWrite < SPI_FLASH_PageSize */
    {
      if (NumOfSingle > count) /* (NumByteToWrite + WriteAddr) > SPI_FLASH_PageSize */
      {
        temp = NumOfSingle - count;

        SPI_FLASH_PageWrite(pBuffer, WriteAddr, count);
        WriteAddr +=  count;
        pBuffer += count;

        SPI_FLASH_PageWrite(pBuffer, WriteAddr, temp);
      }
      else
      {
        SPI_FLASH_PageWrite(pBuffer, WriteAddr, NumByteToWrite);
      }
    }
    else /* NumByteToWrite > SPI_FLASH_PageSize */
    {
      NumByteToWrite -= count;
      NumOfPage =  NumByteToWrite / SPI_FLASH_PageSize;
      NumOfSingle = NumByteToWrite % SPI_FLASH_PageSize;

      SPI_FLASH_PageWrite(pBuffer, WriteAddr, count);
      WriteAddr +=  count;
      pBuffer += count;

      while (NumOfPage--)
      {
        SPI_FLASH_PageWrite(pBuffer, WriteAddr, SPI_FLASH_PageSize);
        WriteAddr +=  SPI_FLASH_PageSize;
        pBuffer += SPI_FLASH_PageSize;
      }

      if (NumOfSingle != 0)
      {
        SPI_FLASH_PageWrite(pBuffer, WriteAddr, NumOfSingle);
      }
    }
  }
  #endif
}

/*******************************************************************************
* Function Name  : SPI_FLASH_BufferRead
* Description    : Reads a block of data from the FLASH.
* Input          : - pBuffer : pointer to the buffer that receives the data read
*                    from the FLASH.
*                  - ReadAddr : FLASH's internal address to read from.
*                  - NumByteToRead : number of bytes to read from the FLASH.
* Output         : None
* Return         : None
*******************************************************************************/
void SPI_FLASH_BufferRead(unsigned char* pBuffer, unsigned int ReadAddr)
{
#ifdef GC_NRF52_SPI_FLASH
	unsigned char tx_data[255];
#elif defined GC_NRF51_SPI_FLASH
	unsigned char tx_data[260];
#else 
#endif 
	memset(tx_data,0,sizeof(tx_data));

	tx_data[0]=W25X_ReadData;
	tx_data[1]=(ReadAddr & 0xFF0000) >> 16;
	tx_data[2]=(ReadAddr& 0xFF00) >> 8;
	tx_data[3]=ReadAddr & 0xFF;

#ifdef GC_NRF52_SPI_FLASH
	//if (nrf_drv_spi_transfer(&spi_flash, tx_data, sizeof(tx_data), pBuffer, 255) != NRF_SUCCESS)
	spi_send_recv(tx_data, pBuffer, 250);
#elif defined GC_NRF51_SPI_FLASH
	if(!spi_master_tx_rx(m_spi1_base_address, 260, tx_data, pBuffer))
	{
		printf("\n\r[SPI_FLASH_BufferRead] spi rx/tx fail.");
	}
#else /* GC_NRF52_SPI_FLASH */
#endif /* GC_NRF52_SPI_FLASH */
}

/*******************************************************************************
* Function Name  : SPI_FLASH_ReadID
* Description    : Reads FLASH identification.
* Input          : None
* Output         : None
* Return         : FLASH identification
*******************************************************************************/
unsigned int SPI_FLASH_ReadID(void)
{
	unsigned char tx_data[4],rx_data[4];
	unsigned int data;

	tx_data[0]=W25X_JedecDeviceID;
	tx_data[1]=0;
	tx_data[2]=0;
	tx_data[3]=0;

	
	//ks_printf("\n\r[spi_flash]  tx = %02x %02x %02x %02x", tx_data[0],tx_data[1],tx_data[2],tx_data[3]);
#ifdef GC_NRF52_SPI_FLASH
	//if (nrf_drv_spi_transfer(&spi_flash, tx_data, sizeof(tx_data), rx_data, sizeof(rx_data)) != NRF_SUCCESS)
	spi_send_recv(tx_data, rx_data, 4);
#elif defined GC_NRF51_SPI_FLASH
	if(!spi_master_tx_rx(m_spi1_base_address, 4, tx_data, rx_data))
	{
		printf("\n\r[SPI_FLASH] spi rx/tx fail.");
	}
#else /* GC_NRF52_SPI_FLASH */
#endif /* GC_NRF52_SPI_FLASH */
	data = (rx_data[1]<<16) + (rx_data[2]<<8) + rx_data[3];

	//ks_printf("\n\r[spi_flash]  rx = %06x", data);
	
  return data;
}
/*******************************************************************************
* Function Name  : SPI_FLASH_ReadID
* Description    : Reads FLASH identification.
* Input          : None
* Output         : None
* Return         : FLASH identification
*******************************************************************************/
unsigned int SPI_FLASH_ReadDeviceID(void)
{
  unsigned int Temp = 0;
#if 0
  /* Select the FLASH: Chip Select low */
  SPI_FLASH_CS_LOW();

  /* Send "RDID " instruction */
  SPI_FLASH_SendByte(W25X_DeviceID);
  SPI_FLASH_SendByte(Dummy_Byte);
  SPI_FLASH_SendByte(Dummy_Byte);
  SPI_FLASH_SendByte(Dummy_Byte);

  /* Read a byte from the FLASH */
  Temp = SPI_FLASH_SendByte(Dummy_Byte);

  /* Deselect the FLASH: Chip Select high */
  SPI_FLASH_CS_HIGH();
#endif
  return Temp;
}
/*******************************************************************************
* Function Name  : SPI_FLASH_StartReadSequence
* Description    : Initiates a read data byte (READ) sequence from the Flash.
*                  This is done by driving the /CS line low to select the device,
*                  then the READ instruction is transmitted followed by 3 bytes
*                  address. This function exit and keep the /CS line low, so the
*                  Flash still being selected. With this technique the whole
*                  content of the Flash is read with a single READ instruction.
* Input          : - ReadAddr : FLASH's internal address to read from.
* Output         : None
* Return         : None
*******************************************************************************/
void SPI_FLASH_StartReadSequence(unsigned int ReadAddr)
{
#if 0
  /* Select the FLASH: Chip Select low */
  SPI_FLASH_CS_LOW();

  /* Send "Read from Memory " instruction */
  SPI_FLASH_SendByte(W25X_ReadData);

  /* Send the 24-bit address of the address to read from -----------------------*/
  /* Send ReadAddr high nibble address byte */
  SPI_FLASH_SendByte((ReadAddr & 0xFF0000) >> 16);
  /* Send ReadAddr medium nibble address byte */
  SPI_FLASH_SendByte((ReadAddr& 0xFF00) >> 8);
  /* Send ReadAddr low nibble address byte */
  SPI_FLASH_SendByte(ReadAddr & 0xFF);
  #endif
}

