kc4712/NRF52840/drivers/spi_flash.c
/*******************************************************************************
* Function Name  : SPI_FLASH_ReadByte
* Description    : Reads a byte from the SPI Flash.
*                  This function must be used only if the Start_Read_Sequence
*                  function has been previously called.
* Input          : None
* Output         : None
* Return         : Byte Read from the SPI Flash.
*******************************************************************************/
unsigned char SPI_FLASH_ReadByte(void)
{
  return (SPI_FLASH_SendByte(Dummy_Byte));
}

/*******************************************************************************
* Function Name  : SPI_FLASH_SendByte
* Description    : Sends a byte through the SPI interface and return the byte
*                  received from the SPI bus.
* Input          : byte : byte to send.
* Output         : None
* Return         : The value of the received byte.
*******************************************************************************/
unsigned char SPI_FLASH_SendByte(unsigned char byte)
{
#if 0
  /* Loop while DR register in not emplty */
  while (SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_TXE) == RESET);

  /* Send byte through the SPI1 peripheral */
  SPI_I2S_SendData(SPI1, byte);

  /* Wait to receive a byte */
  while (SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_RXNE) == RESET);

#if 1  //mjhan.

#endif
  /* Return the byte read from the SPI bus */
  return SPI_I2S_ReceiveData(SPI1);
#endif
return 1;
}

/*******************************************************************************
* Function Name  : SPI_FLASH_SendHalfWord
* Description    : Sends a Half Word through the SPI interface and return the
*                  Half Word received from the SPI bus.
* Input          : Half Word : Half Word to send.
* Output         : None
* Return         : The value of the received Half Word.
*******************************************************************************/
unsigned short SPI_FLASH_SendHalfWord(unsigned short HalfWord)
{
#if 0
  /* Loop while DR register in not emplty */
  while (SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_TXE) == RESET);

  /* Send Half Word through the SPI1 peripheral */
  SPI_I2S_SendData(SPI1, HalfWord);

  /* Wait to receive a Half Word */
  while (SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_RXNE) == RESET);

  /* Return the Half Word read from the SPI bus */
  
  return SPI_I2S_ReceiveData(SPI1);
#endif

return 0;

}

/*******************************************************************************
* Function Name  : SPI_FLASH_WriteEnable
* Description    : Enables the write access to the FLASH.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
int32_t SPI_FLASH_WriteEnable(void)
{
	unsigned char tx_data[4],rx_data[4];

	tx_data[0]=W25X_WriteEnable;
	tx_data[1]=0;
	tx_data[2]=0;
	tx_data[3]=0;
	
	//ks_printf("\n\rSPI_FLASH_WriteEnable");
#ifdef GC_NRF52_SPI_FLASH
	//if (nrf_drv_spi_transfer(&spi_flash, &tx_data[0], 1, rx_data, sizeof(rx_data)) != NRF_SUCCESS)
	return spi_send_recv(tx_data, rx_data, 1);
#elif defined GC_NRF51_SPI_FLASH
	if(!spi_master_tx_rx(m_spi1_base_address, 1, tx_data, rx_data))
	{
		printf("\n\r[SPI_FLASH_WriteEnable] spi rx/tx fail.");
	}
#else /* GC_NRF52_SPI_FLASH */
#endif  /* GC_NRF52_SPI_FLASH */
}

/*******************************************************************************
* Function Name  : SPI_FLASH_WaitForWriteEnd
* Description    : Polls the status of the Write In Progress (WIP) flag in the
*                  FLASH's status  register  and  loop  until write  opertaion
*                  has completed.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void SPI_FLASH_WaitForWriteEnd(void)
{
#if 0
  unsigned char FLASH_Status = 0;

  /* Select the FLASH: Chip Select low */
  SPI_FLASH_CS_LOW();

  /* Send "Read Status Register" instruction */
  SPI_FLASH_SendByte(W25X_ReadStatusReg);

  /* Loop as long as the memory is busy with a write cycle */
  do
  {
    /* Send a dummy byte to generate the clock needed by the FLASH
    and put the value of the status register in FLASH_Status variable */
    FLASH_Status = SPI_FLASH_SendByte(Dummy_Byte);
  }
  while ((FLASH_Status & WIP_Flag) == SET); /* Write in progress */

  /* Deselect the FLASH: Chip Select high */
  SPI_FLASH_CS_HIGH();
  #endif
}


//power down mode 입력.
void SPI_Flash_PowerDown(void)
{
#if 0
  /* Select the FLASH: Chip Select low */
  SPI_FLASH_CS_LOW();

  /* Send "Power Down" instruction */
  SPI_FLASH_SendByte(W25X_PowerDown);

  /* Deselect the FLASH: Chip Select high */
  SPI_FLASH_CS_HIGH();
#endif 
}

void SPI_Flash_WAKEUP(void)
{
#if 0 
  /* Select the FLASH: Chip Select low */
  SPI_FLASH_CS_LOW();

  /* Send "Power Down" instruction */
  SPI_FLASH_SendByte(W25X_ReleasePowerDown);

  /* Deselect the FLASH: Chip Select high */
  SPI_FLASH_CS_HIGH();                   //等待TRES1
#endif
}

/* GC_NRF52_PAHR */
void __cmd_spi_tx(uint32_t value, int len)
{
	unsigned char tx_data[4];
	unsigned char rx_data[4];
	NRF_SPIM_Type * p_spim = spi_flash.p_registers;

	tx_data[0]= value & 0x000000FF;
	tx_data[1]= (value & 0x0000FF00) >> 8;
	tx_data[2]= (value & 0x00FF0000) >> 16;
	tx_data[3]= (value & 0xFF000000) >>  24;
	
	printf("\r\n Maxcount Tx/Rx %d, %d", p_spim->TXD.MAXCNT, p_spim->RXD.MAXCNT);
	printf("\r\n Tx 0x%x 0x%x 0x%x 0x%x", tx_data[0], tx_data[1], tx_data[2], tx_data[3]);
	printf("\r\n Tx %u %u %u %u", &tx_data[0], &tx_data[1], &tx_data[2], &tx_data[3]);
	
	nrf_gpio_pin_clear(GC_SPI_FLASH_CS_PIN);
	spi_send_recv( tx_data,rx_data,len);
	nrf_gpio_pin_set(GC_SPI_FLASH_CS_PIN);

}
/* end of GC_NRF52_PAHR */




/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
